-- SQLPratice 01
-- 1. SQL의 풀네임과 간단한 정의를 기술하세요
   
-- 2. SQL 언어 종류 3가지를 기술하세요 

-- 3. 각 언어의 대표 명령어 작성하세요 

-- 4. SELECT 명령어의 전체 구조를 기술하세요 

-- -----------------------------------------------------------------------------------------------------------
-- SQLPratice 02  본인이 작성한 스크립트와 실행 화면  캡쳐하여 보내주세요
 
-- 1. 강사강의자료 < 2 MySQL 기반 데이터베이스 < data 디렉토리 < demo_hr.sql 을  source 명령어를 이용하여 hr데이터베이스와 데이터를 생성하세요
-- 2. 사용자 : hr 계정을 만들고 비밀번호는 hr 로 생성하세요
-- 3. hr계정 사용자에게 hr데이터베이스 접근 권한을 모두 부여하세요 
-- 4. hr 계정 테이블관계와 테이블간의 구조를 확인하세요 
-- 5. hr계정으로 접속하여 hr데이터베이스에 접속하세요
-- -----------------------------------------------------------------
-- SQLPratice 03  본인이 작성한 스크립트와 실행 화면  캡쳐하여 보내주세요
 
   슬랙에 올려드린 테이블생성.pdf 분석하여 ssg 계정에서 ssgdb데이터베이스에 테이블을 만드세요 

-- 테이블 수정 (product_ID 새로운 컬럼 추가하세요. 정수형(int)이며 널을 허용하지 않으며 유일한 속성을 가집니다.)

-- 테이블 수정 ( product_ID 컬럼 삭제)

-- cost 컬럼의 이름을 정수형 (int) pay 로 변경하세요


-- productName 컬럼 앞에 product_ID 컬럼을 추가 


-- 테이블에 pay  컬럼 뒤에 descript varchar(50)형 컬럼을  추가 하세요


-- descript 컬럼의  타입을 text 로 변경하세요 
